In [1]:
# 7.1 Handling Missing Data

In [2]:
# for data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent misssing data
# this is called  asentienl value; when present, it indicates a missing (or null) value
import pandas as pd
import numpy as np

float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
# .isna() gives a Boolean Series of result; null = TRUE
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# as alternative to 'NA', a built-in 'None' (case-sensitive) value is also used
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# NA handling object methods
# .dropna() : filter axis labels based on whether values for eahc label have missing data
#          with varying thresholds for how much missing data to tolerate
# .fillna() : fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"
# .isna() : return Boolean values indicating which values are missing/NA
# .notna() : negation of isna, returns True for non-NA values and False for NA values

In [9]:
# Filtering Out Missing Data

In [10]:
# using .dropna() in Series
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# another way to filter out missing data in Series
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
# removing missing data in DataFrames - either drop rows or columns that are all NA, or only dropping rows or columns containing any NA
# .dropna() by default drops any row containing a missing value
data = pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()
# drops all the rows containing any NA

     0    1    2
0  1.0  6.5  3.0

In [15]:
# passing how = "all" will drop only rows that are all NA
data.dropna(how="all")

# these functions don't modify the original object, just creates a new object

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to drop columns containing NA, pass the argument axis = "columns"
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# only keeping rows contianing at most a certain number of missing observations
# indicate this with the thresh argument
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  1.264755 -0.580949  0.143334
1 -0.165008  1.971264 -1.460118
2  0.025127  0.509919 -0.482368
3 -0.605611  0.815708  0.173941
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [19]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  1.264755       NaN       NaN
1 -0.165008       NaN       NaN
2  0.025127       NaN -0.482368
3 -0.605611       NaN  0.173941
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [20]:
df.dropna()

          0         1         2
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [21]:
# using argument thresh
df.dropna(thresh=2)
# thresh = 2 means non-NaN threshold is 2 (at least 2 non-NaN values), if threshold not met, drop
# thresh = N means the row needs N "votes" to stay in the DataFrame

          0         1         2
2  0.025127       NaN -0.482368
3 -0.605611       NaN  0.173941
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [22]:
# Filling In Missing Data

In [23]:
# .fillna() : filling NaN with a constant
df.fillna(0)

          0         1         2
0  1.264755  0.000000  0.000000
1 -0.165008  0.000000  0.000000
2  0.025127  0.000000 -0.482368
3 -0.605611  0.000000  0.173941
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [24]:
# using fillna() with a dictioinary, can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  1.264755  0.500000  0.000000
1 -0.165008  0.500000  0.000000
2  0.025127  0.500000 -0.482368
3 -0.605611  0.500000  0.173941
4 -0.849578  1.183466 -1.507954
5  0.538385 -0.279566 -0.276254
6 -2.015624  1.152707  0.748319

In [25]:
# the same interpolation methods available for reindexing can be used with fillna()
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  0.355013  0.903624  0.407944
1 -0.205865 -0.166098 -0.939379
2 -0.304505  0.244700  1.754216
3  0.676615 -0.990933 -1.274227
4 -0.460511 -0.001022 -1.014919
5  0.270801 -0.922212  0.888635

In [26]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0  0.355013  0.903624  0.407944
1 -0.205865 -0.166098 -0.939379
2 -0.304505       NaN  1.754216
3  0.676615       NaN -1.274227
4 -0.460511       NaN -1.014919
5  0.270801       NaN  0.888635

In [27]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0  0.355013  0.903624  0.407944
1 -0.205865 -0.166098 -0.939379
2 -0.304505       NaN  1.754216
3  0.676615       NaN -1.274227
4 -0.460511       NaN       NaN
5  0.270801       NaN       NaN

In [28]:
df.fillna(method="ffill")
# "ffill" means forward fill; as in Excel "Duplicate Down"
# the NaN values are filled with the preceding non-NaN values, however, ffill stops when it hits a new non-NaN value
# opposite of "ffill" is "bfill" (back fill)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_21004\1120536992.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.355013  0.903624  0.407944
1 -0.205865 -0.166098 -0.939379
2 -0.304505 -0.166098  1.754216
3  0.676615 -0.166098 -1.274227
4 -0.460511 -0.166098 -1.274227
5  0.270801 -0.166098 -1.274227

In [29]:
df.fillna(method="ffill",limit=2)

# "limit = 2" means limit the fill to 2 rows

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_21004\2927788966.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  0.355013  0.903624  0.407944
1 -0.205865 -0.166098 -0.939379
2 -0.304505 -0.166098  1.754216
3  0.676615 -0.166098 -1.274227
4 -0.460511       NaN -1.274227
5  0.270801       NaN -1.274227

In [30]:
# with .fillna() simple data imputation using median or mean statistics is available
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())
# fill the NaN values with .mean()

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# .fillna() function arguments
# value : scalar value or dictionary-like object to use to fill missing values
# method : interpolation method - one of "bfill" or "ffill"; default is None
# axis : axis to fill on ("index" or "columns"); default is axis="index"
# limit : for ffill and bfill, maximum number of consecutive periods to fill

In [33]:
# Data Transformation

In [34]:
# Removing Duplicates

In [35]:
# removing duplicate rows
data = pd.DataFrame({"k1":["one","two"]*3 + ["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# DataFrame .duplicated() method returns a Boolean Series indicating whether each row is a duplicate oe nor
# duplicate means its column values are exactly equal to those in an earlier row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# relatedly, drop_duplicates() returns a DataFrame with rows where the duplicated array is False filtered out
data.drop_duplicates()

# both methods, .duplicated() and .drop_duplicates() by default consider all of the columns;
# alternatively, can specify any subset of them to detect duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
# having an additional column of values, and want to filter duplicates based only on the "k1" column
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
# set column with subset argument
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
# .duplicated() and .drop_duplicates() by default keep the first observed value combination
# passing keep="last" argument will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
# Transformming Dta Using a Function or Mapping
# transformation based on the values in an array, Series, or column in a DataFrame
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                     "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
# suppose we wanted to add a column indicating the type of animal for each food
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [43]:
# .map() method on a Series accepts a function or dictionary-like object containing a mapping
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# could also have passed a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
# using .map() is a convenient way to perform element-wise transformatioins and other data cleaning-related operations

In [46]:
# Replacing Values
# .map() can be used to modify a subset of values in an object,
# but .replace() provides a simpler and more flexible way
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
# using "-999" values as sentinel values for missing data - replacing those with NA values
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
# replacing multiple values at once - passing a list with substitute values
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
# replacing different values for each, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
# passing argument can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# renaming axis indexes
# axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects
# modifying the axes in place without creating a new data structure
data = pd.DataFrame(np.arange(12).reshape((3,4)),
        index = ["ohio","Colorado","New York"],
        columns = ["one","two","three","four"])
data

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
# .map() method for axis indexes, just like in Series
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
# can assign to the index attribute, modifying the DataFrame in place
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
# if wanting to create a transformed version without modifying the origina, .renam() can be used
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
# .rename() can be used in conjuction with a dictionary-like object
data.rename(index={"OHIO":"INDIANA"},
           columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
# Discretization and Binning
# data about a group of people in a study, gropuping them into discreet age buckets
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
# bins = 18 to 25, 26 to 35, 36 to 60, and 61 and older
# use pd.cut()
bins = [18,25,35,60,100]
age_categories = pd.cute(ages,bins)
age_categories

AttributeError: module 'pandas' has no attribute 'cute'

In [ ]:
bins = [18,25,35,60,100]
age_categories = pd.cut(ages,bins)
age_categories
# each bin is identified by a special interval value type containing lower and upper limit of each bin

In [ ]:
# data codified in numberical integers (the "pointer" to the category)
age_categories.codes

In [ ]:
# index of unique labels created; telling what the buckets are called, the "reference table"
age_categories.categories

In [ ]:
age_categories.categories[0]

In [ ]:
# pd.value_counts() are the bin counts for the result of pd.cut()
pd.value_counts(age_categories)

In [ ]:
# in the string representation of an interval, a parenthesis means that the side is open (exclusive)
# square bracket means it's closed (inclusive)
# can change which side is closed by passing "right = False"
pd.cut(ages,bins,right=False)

In [ ]:
# can overrid the default interval-based bin labeling, by passing a list or arroy to the labels
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

In [ ]:
# passing an integer number of bins to pd.cut() instead of explicit bin edges,
# it will compute equal-length bins based on min and max values
data = np.random.uniform(size=20)
data

In [ ]:
pd.cut(data,4,precision=2)

In [ ]:
# pd.qcut() bins the data based on sample quantiles
# it will obtain roughly equally sized bins (slicing in quantiles)
data = np.random.standard_normal(1000)
data

In [ ]:
quartiles = pd.qcut(data,4,precision=2)
quartiles

In [ ]:
pd.value_counts(quartiles)

In [ ]:
# similar to pd.cut(), can pass own quantiles (between 0 and 1, inclusive)
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

In [ ]:
# Detecting and Filetering Outliers
# filtering and transforming relates applying array operations
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data

In [ ]:
data.describe()

In [ ]:
# filtering values in one of the columns exceeding 3 in absolute value
col = data[2]
col[col.abs() > 3]

In [ ]:
# selecting rows having a value exceeding 3 or -3, can use any method on a Boolean DataFrame
data[(data.abs() > 3).any(axis="columns")]
# .any() asks if there is any TRUE value in the axis (axis="columns" in this case)
# .all() asks if all of the values TRUE

In [ ]:
# capping values outside the interval -3 to 3
data[data.abs() > 3] = np.sign(data)*3
data

# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative

In [ ]:
data.describe()

In [ ]:
# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative
np.sign(data).head()

In [ ]:
# Permutation and Random Sampling
# permuting (randomly reordering) the rows in a DataFrame
# np.random.permuitation() with length of the axis wanting to permute prodcues an array of integers of new ordering
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

In [ ]:
sampler = np.random.permutation(5)
sampler

In [ ]:
# array can then be used in iloc-based indexing or the equivalent .take() function
df.take(sampler)

In [ ]:
df.iloc[sampler]

In [ ]:
# by invoking .take() with axis="columns", can also select a permutation of the columns
column_sampler = np.random.permutation(7)
column_sampler

In [ ]:
df.take(column_sampler,axis="columns")

In [ ]:
# np.random.permutation() is simply generating random array of integers in random order
np.random.permutation(15)

In [ ]:
# to select a random subset without replacement (the same row cannot appear twice)
# can use .sample() on Series and DataFrame
# "n=" seems to be number of rows
df.sample(n=3)

In [ ]:
# to generate sample WITH replacement (to allow repeat choices)
# pass "replace=True" to .sample()
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

In [ ]:
# Computing Indicator / Dummy Variables
# common statistical modeling or machine learning application
# converting a categorical variable into a dummy or indicator matrix
# if column in a DataFrame has k distinct values, derive a matrix or DataFrame with k column containing all 1s and 0s
# pd.get_dummires() 
df = pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":range(6)})
df

In [ ]:
pd.get_dummies(df["key"])

In [ ]:
# in some cases, adding a prefix to the columns in the indicator DataFrame could be helpful
# prefix can e merged with the other data
# pd.get_dummies() has a prefix argument
dummies = pd.get_dummies(df["key"],prefix="shit")
dummies

In [ ]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

In [ ]:
# if row in a DataFrame belongs to multiple categories, use different approach to create dummy varaiables
mnames = ["movie_id","title","genres"]

In [ ]:
movies = pd.read_table("datasets/movielens/movies.dat",sep="::",
                      header=None,names=mnames,engine="python")
movies[:10]

In [ ]:
# pandas has a special Series method str.get_dummies() (methods that start with string)
# multiple group membership encoded as a delimited string
dummies = movies["genres"].str.get_dummies("|")
dummies

In [ ]:
dummies.iloc[:10,:6]

In [ ]:
# as before, can combine this with movies while adding a "Genre_" to the column names in dummies DataFrame
# .add_prefix()
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

In [ ]:
# for much larger data, this method is not especially speedy
# it would be better to write a lower-level function that writes directly to a Numpy array
# and wrap the result in a DataFrame

In [ ]:
# a useful recipe for statistical application is to combine pd.get_dummies() with pd.cut()
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

In [ ]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

In [ ]:
# 7.3 Extension Data Types
# Numpy has some disagreeing aspects with Pandas
# such as for NaN, pandas converted the data type to float64 and used np,nan
# this has compounding effects by introducing subtle issues
# datasets with a lot of string data were computationally expensive and use a lot of memory
# recently, pandas has developed an extention type system independent to NumPy
# creating and example Series with missing value
s = pd.Series([1,2,3,None])
s

In [ ]:
s.dtype
# for backward compatibility, Series use legacy behavior of using float64 data type and np.nan for missing value

In [ ]:
# Creating Series wiht pd.Int64Dtype()
s = pd.Series([1,2,3,None],dtype=pd.Int64Dtype())
s

In [ ]:
s.isna()
# NA means value is missing for extension type array

In [ ]:
s[3]

In [ ]:
s[3] is pd.NA

In [ ]:
# we also could have used the shorthand "Int64" instead of pd.Int64Dtype() to specify type
s = pd.Series([1,2,3,None],dtype="Int64")
s

In [ ]:
s = pd.Series(['one','two',None,'three'],dtype=pd.StringDtype())
s

In [ ]:
# string arrayts generally use much less memory and are frequently computationally more efficient on large datasets
# another important extension type is Categorical
# extension types can be passed to the Series .astype() method, in data cleaning process
df = pd.DataFrame({"A":[1,2,None,4],
                  "B":["one","two","three",None],
                  "C":[False,None,False,True]})
df

In [ ]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

In [ ]:
# pandas extension data types
# BooleanDtype : Nullable Boolean data, use 'boolean' when passing as string
# CategoricalDtype : Categorical data type, use 'category' when passing as string
# DatetimeTZDtype : Datetime with time zone
# Float32Dtype : 32-bit nullable floating point, use "Float32" when passing as string
# Float64Dtype : 64-bit nullable floating point, use "Float64" when passing as string
# Int8Dtype : 8-bit nullable signed integer, use "Int8" when passing as string
# Int32Dtype : 32-bit nullable signed integer, use "Int32" when passing as string
# Int64Dtype : 64-bit nullable signed integer, use "Int64" when passing as string
# UInt8Dtype : 8-bit nullable unsigned integer, use "UInt8" when passing as a string
# UInt16Dtype : 16-bit nullable unsigned integer, use "UInt16" when passing as a string
# UInt32Dtype : 32-bit nullable unsigned integer, use "UInt32" when passing as a string
# UInt64Dtype : 64-bit nullable unsigned integer, use "UInt64" when passing as a string

In [ ]:
# 7.4 String Manipulation

In [ ]:
# Python built-in String Object Methods
# comma-separated string can be broken into pieces with .split()
val = "a,b, guido"

In [ ]:
val.split(",")

In [ ]:
# .split() is often combined with strip to trim whitespace (including line breaks)
pieces = [x.strip() for x in val.split(",")]
pieces

In [ ]:
# these substrings could be concatenated together with a two-colon delimiter using addition
first, second, third = pieces
pieces

In [ ]:
first + "::" + second + "::" + third

In [ ]:
# but this isn't a practial generic method; a faster and more Pythonic way is to pass a list or tuple to the .join()
"::".join(pieces)

In [ ]:
# other methods are concerned with locating substrings
# using "in" keyword is the best way to detect a substring, though index and find can also be used
"guido" in val

In [ ]:
val.index(",")

In [ ]:
val.find(":")

In [ ]:
# note that the difference between .find() and .index();
# that index raises an exception if the string isn't found (versus returning -1)
val.index(":")

In [ ]:
# .count() returns the number of occurrences of a praticular substring
val.count(",")

In [ ]:
# .replace will substitute occurrences of one pattern for another
# it is commonly used to delete patterns, too, by passing an empty string
val.replace(",","::")

In [ ]:
val.replace(",","")

In [ ]:
# Python built-in string methods
# .count() : Return the number of nonoverlapping occurrences of substring in the string
# .endswith() : Return True if string ends with suffix
# .startswith() : Return True if string starts with prefix
# .join() : Use string as delimiter for concatenating a sequence of other strings
# .index() : Return starting index of the first occurrence of passed substring if found in string;
#            otherwise, raises ValueError if not found
# .find() : Return position of first character of first occurrence of substring in the string;
#           like index, but returns -1 if not found
# .rfind() : Return postion of first character of last occurrence of substring in the string;
#           returns -1 if not found
# .replace() : Replace occurrences of string with another string
# .strip(), .rstrip(), .lstrip() :
# Trim whitespace, including newlines on both sides, on the right side, or on the left side
# .split() : Break string into list of substrings using passed delimiter
# .lower() : Convert alphabet characters to lowercase
# .upper() : Convert alphabet characters to uppercase
# .casefold() : Convert characters to lowercase, and convert any region-specific varable character combinations to a common comparable form
# .ljust(), .rjust() : Left justify or right justify, respectively;
#                     pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width

In [ ]:
# Regular Expressions
# regular expressions provide a felxible way to search or match string patterns in text
# a single expression, commonly called regex, is a string formed according to the regular expression language

# re module functions fall into three categories:
# pattern matching, substitution, and splitting
# splitting a variable number of whitespace characters - tabs, spaces, and newlines
# the regex describing one or more whitespace characters is \s+:

import re
text = "foo  bar\tbaz \tqux"
text

In [ ]:
re.split(r"\s+",text)

In [ ]:
# always use r for regex pattern; r stands for "Raw"
# \s means "any whitespace"; + means "one or more"
# and import re! so, re.split(r"\s+", text) is like Excel's TRIM()

In [ ]:
# when calling re.split(r"\s+", text), the regex is first compiled, and then its .split() is called on the passed text
# can compile the regex yourself with re.compile(); this forms a reusable regex object
regex = re.compile(r"\s+")

In [ ]:
regex

In [ ]:
regex.split(text)

In [ ]:
# instead, if wanted to get a list of all patterns matching the regex, can use .findall()
regex.findall(text)

In [ ]:
# creating a regex object with re.compile() is highly recommended, for saving CPU cycles

In [ ]:
# match and search are closly related to .findall()
# while .findall() returns all matches in a string, .search() returnls only the first match
# .match() only matches at the beginning of the string
# email addresses as example
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# [A-Z0-9._%+-] : Find those patterns, any character in that is allowed
# + : "one or more"
# @ : find "@"
# [A-Z0-9.-] : A-Z, 0-9, ., - are allowed
# + = "one or more"; \. : find "."
# [A-Z]{2,4} : find A-Z but between 2 and 4 charecters long (e.g. .com, .de, .info)

regex = re.compile(pattern,flags=re.IGNORECASE)
# compile (contain) from the object "pattern" into object "regex", ignore cases

In [ ]:
# using .findall()
regex.findall(text)

In [ ]:
# .search() returns a special match object for the first email address in the text
# .match() object can only tell us the start and end position of the pattern in the string
m = regex.search(text)
m

In [ ]:
text[m.start():m.end()]

In [ ]:
# regex.match returns None, as it will match only if the pattern occurs at the start of the string
print(regex.match(text))

In [ ]:
# .sub() will return a new string with occurrences of the pattern replaced by a new string
print(regex.sub("REDACTED",text))

# .sub() functions like Excel's "Find and replace"

In [ ]:
# suppose you want to segment each addres into 3 components - user name, domain name, and domain suffix
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern,flags=re.IGNORECASE)

In [ ]:
# returning a tuple of pattern components with .groups() method
m = regex.match("wesm@bright.net")
m.groups()

In [ ]:
# findall() returns a list of tuples when pattern has groups
regex.findall(text)

In [ ]:
# .sub() also has access to .groups() in each .match() using special symbols; \1 \2
# \1 corresponds to the first matched group, \2 corresponds to the second, and so forth
print(regex.sub(r"Username:\1,Domain:\2,Suffix:\3",text))

In [ ]:
# more regular expressions
# .findall() : Return all noneoverlapping matching patterns in a string as a list
# .finditer : Like .findall() but returns an iterator
# .match() : Match pattern at start of the string and optionally segment pattern components into groups;
#            if the pattern matches, return a match object, and otherwise None
# .search() : Scan string for match to pattern, returning a match object if so;
#             unlike .match(), the match can be anywhere in the string
# .split() : Break string into pieces at each occurrence of pattern
# .sub(), .subn() : Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression;
#                   use symbols \1, \2, ... to refer to match group elements in the replacement string

In [ ]:
# String Functions in pandas
# cleaning up messy string data; dealing with missing data
data = {"Dave":"dave@google.com","Steve":"steve@gmail.com",
       "Rob":"rob@gmail.com","Wes":np.nan}
data = pd.Series(data)
data

In [ ]:
data.isna()

In [ ]:
# string and regex expression methods can be applied (passing lambda or other function) to each using data.map()
# but will fail on NA values
# So, Series has array-oriented methods for string operations that skip over and propagate NA values
# accessed through Series' str attribute - can check whether each email address has "gmail" in it with .str.contains()
data.str.contains("gmail")

In [ ]:
# dtype above is object; pandas has extention types that provide for specialized treatment of strings, integers and boolean data
data_as_string_ext = data.astype('string')
data_as_string_ext

In [ ]:
data_as_string_ext.str.contains("gmail")

In [ ]:
# regex can also be used, along with any re options like IGNORECASE
import re
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [ ]:
data.str.findall(pattern,flags=re.IGNORECASE)

In [ ]:
# there are a couple ways to do vectorized elemnet retrieval
# either use str.get() or index into the str attribute
matches = data.str.findall(pattern,flags=re.IGNORECASE).str[0]
matches

In [ ]:
# .str prefix : commanding to go inside every cell and treat the contents as string
# data.str.findall() --> present all of them as they are, which is in boxes (lists)
# data.str.findall().str[0] --> present only the 1st in the boxes, picking them out of the box

In [ ]:
# getting index [1] from the result
matches.str.get(1)

In [ ]:
# can slice strings using the syntax
data.str[:5]

In [ ]:
# .str.extract() will return the captured groups of a regex as a DataFrame
data.str.extract(pattern,
                 flags=re.IGNORECASE)

In [ ]:
# Partial listing of Series string methods
# .cat() : Concatenate strings element-wise with optional delimiter
# .contains() : Return Boolean array if each string contains pattern/regex
# .count() : Count occurrences of pattern
# .extract() : Use a regex with groups to extract one or more strings from a Series of strings;
#              the results will be a DataFrame with one column per group
# .endswith() : Equivalent to x.endswith(pattern) for each element
# .startswith() : Equivalent to x.startswith(pattern) for each element
# .findall() : Compute list of all occurrences of pattern/regex for each string
# .get() : Index into each element (retrieve i-th element)
# .isalnum() : Equivalent to built-in .str.alnum()
# .isalpha() : Equivalent to built-in .str.isalpha()
# .isdecimal() : Equivalent to built-in .str.isdecimal()
# .isdigit() : Equivalent to built-in .str.isdigit()
# .islower() : Equivalent to built-in .str.islower()
# .isnumeric() : Equivalent to built-in .str.isnumeric()
# .isupper() : Equivalent to built-in .str.isupper()
# .join() : Join strings in each element of the Series with passed separator
# .len() : Compute length of each string
# .lower(), .upper() : Covert cases; equivalent to x.lower() or x.upper() for each element
# .match() : Use re.match() with the passed regex on each element, returning True or False whether it matches
# .pad() : Add whitespace to left, right, or both sides of strings
# .center() : Equivalent to .pad(side="both")
# .repeat() : Duplicate values (e.g. s.str.repeat(3) is equivalent to x*3 for each string)
# .replace() : Replace occurrences of pattern/regex with some other string
# .slice() : Slice each string in the Series
# .split() : Split strings on delimiter or regex
# .strip() : Trim whitespace from both sides, including newlines
# .rstrip() : Trim whitespace on right side
# .lstrip() : Trim whitespace on left side

In [ ]:

# 7.5 Categorical Data

In [ ]:
# a column may contain repeated values
# functions like .unique() and .value_counts() enables us to extract the distict values from an array and compute frequencies
values = pd.Series(['apple','orange','apple',
            'apple']*2)
values

In [ ]:
pd.unique(values)

In [ ]:
pd.value_counts(values)

In [ ]:
# many data systems have specialized approaches for representing data with repeated values
# in data warehousing, best practice is to use dimension tables containing distinct values and storing the primary observations as integer keys
values = pd.Series([0,1,0,0]*2)
dim = pd.Series(['apple','orange'])
values

In [ ]:
dim

In [ ]:
# use .take() to restore the original Series of strings
dim.take(values)

In [ ]:
# representation of values as integers is called categorical or dictionary-encoded representation
# array of distinct values can be called the 'categories', 'dictionary', or 'levels' of the data
# in this book is called 'categorical' and 'categories' - referencing categories are called 'category codes' or 'codes'
# can also perform transformations on the categories while leaving the codes unmodified
# transformations can be: renaming categories or appending a new category without changing the order or position of the exsiting categories

In [61]:
# Categorical Extension Type in pandas
# categoriacl extension type for holding data that uses the integer-based categorical representation or 'encoding'
# as a data compression technique with many occurrences of similar values, faster performance & lower memory use for string data
fruits = ['apple','orange','apple','apple']*2
N = len(fruits)

In [62]:
rng = np.random.default_rng(seed=12345)

In [63]:
df = pd.DataFrame({'fruit':fruits,
                   'basket_id':np.arange(N),
                   'count':rng.integers(3,15,size=N),
                   'weight':rng.uniform(0,4,size=N)},
                  columns = ['basket_id','fruit','count','weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [65]:
# on above result, df['fruit'] is array of string; we can convert it to categorical by calling:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [66]:
# now fruit_cat can access via .array attribute, as an instance of pandas.Categorical
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [67]:
# Categorical object has categories and codes attributes
c.categories

Index(['apple', 'orange'], dtype='object')

In [68]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [69]:
# getting a mapping between codes and categories
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [70]:
# can convert a DataFrame columnt to categorical by assiging the coverted result:
df['fruit'] = df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [71]:
# can also create pandas.Categorical directly from other types of sequences:
my_categories = pd.Categorical(['foo','bar','baz','foo','bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [72]:
# if you have obtained categorical encoded data from another source, you can use the alternative .from_codes() constructor:
categories = ['foo','bar','baz']
codes = [0,1,2,0,0,1]
my_cats_2 = pd.Categorical.from_codes(codes,categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [73]:
# categorical conversions assume no specific ordering of categories unless specified
# So categories array may depend on the ordering of the input data
# when using .from_codes() or any other constructors, you can indicate the categories have a meaningful ordering:
ordered_cat = pd.Categorical.from_codes(codes,categories,ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [74]:
# in the result above, [foo < bar < baz], it means 'foo' precedes 'bar' in the ordering
# an unordered categorical instance can be made ordered with .as_ordered():
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [75]:
# Computations with Categoricals
# using categorical compared with the nonencoded (array, strings) generally behaves the same
# .groupby() performs better when working with categoricals, with ordered flag
# random numeric data using pd.qcut() binning function - this returns pd.Categorical
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws

array([-1.42382504e+00,  1.26372846e+00, -8.70661738e-01, -2.59173235e-01,
       -7.53433070e-02, -7.40884652e-01, -1.36779270e+00,  6.48892802e-01,
        3.61058113e-01, -1.95286306e+00,  2.34740965e+00,  9.68496906e-01,
       -7.59387180e-01,  9.02198274e-01, -4.66953173e-01, -6.06895187e-02,
        7.88844345e-01, -1.25666813e+00,  5.75857514e-01,  1.39897899e+00,
        1.32229806e+00, -2.99698515e-01,  9.02919341e-01, -1.62158273e+00,
       -1.58189261e-01,  4.49483932e-01, -1.34360107e+00, -8.16875907e-02,
        1.72473993e+00,  2.61815943e+00,  7.77361344e-01,  8.28633196e-01,
       -9.58988313e-01, -1.20938829e+00, -1.41229201e+00,  5.41546830e-01,
        7.51939396e-01, -6.58760320e-01, -1.22867499e+00,  2.57557768e-01,
        3.12902918e-01, -1.30811690e-01,  1.26998312e+00, -9.29624577e-02,
       -6.61508890e-02, -1.10821447e+00,  1.35956851e-01,  1.34707776e+00,
        6.11440210e-02,  7.09146003e-02,  4.33654537e-01,  2.77483660e-01,
        5.30252387e-01,  5.36720969e-01,  6.18350015e-01, -7.95017456e-01,
        3.00030946e-01, -1.60270159e+00,  2.66798830e-01, -1.26162378e+00,
       -7.12708062e-02,  4.74049730e-01, -4.14853761e-01,  9.77165000e-02,
       -1.64041784e+00, -8.57258824e-01,  6.88281788e-01, -1.15452958e+00,
        6.50452389e-01, -1.38835995e+00, -9.07382457e-01, -1.09542531e+00,
        7.14569494e-03,  5.34359903e-01, -1.06580785e+00, -1.81472740e-01,
        1.62195180e+00, -3.17391946e-01, -8.15814967e-01,  3.86579017e-01,
       -2.23638926e-01, -7.01690809e-01, -1.79571318e+00,  8.18325622e-01,
       -5.71032902e-01,  7.85525063e-04, -1.06364272e+00,  1.30171450e+00,
        7.47872942e-01,  9.80875909e-01, -1.10418688e-01,  4.67918531e-01,
        8.90607150e-01,  1.02300937e+00,  3.12383389e-01, -6.19046857e-02,
       -3.59479647e-01, -7.48643984e-01, -9.65478907e-01,  3.60034657e-01,
       -2.44552532e-01, -1.99585661e+00, -1.55247617e-01,  1.06383087e+00,
       -2.75171567e-01, -1.85333593e+00, -1.24341928e-01,  7.84974522e-01,
        2.01998597e-01, -4.28074443e-01,  1.84828890e+00,  1.89995289e+00,
       -9.84250348e-02,  8.13445440e-01,  3.92494389e-01,  7.81442900e-01,
        1.45327152e+00,  8.20186045e-01,  8.77053446e-02, -6.53505648e-01,
       -8.11886879e-01, -2.55381724e-02,  1.15818454e+00,  3.00520870e-01,
        5.30566461e-02,  2.57271524e-01,  3.57428624e-02,  5.47236686e-01,
       -1.12296158e+00, -1.97524767e+00, -4.25150050e-01, -1.14907382e+00,
        1.61513805e+00, -1.58476860e-01, -2.52873345e-01, -1.53815403e+00,
        2.82086033e-01, -6.23612134e-01,  1.12182226e+00,  8.41221031e-01,
       -7.75896101e-01,  4.10716440e-01, -2.72241610e+00, -6.73304799e-01,
        1.24622153e+00,  7.90208028e-01,  1.75340888e-01, -2.92946016e-02,
       -1.41951426e+00, -1.35996632e+00,  2.23411559e-01,  1.76177943e+00,
       -2.17088985e+00,  6.28488171e-01,  6.01196526e-01,  9.50757858e-01,
       -8.69246667e-01, -5.29007071e-01,  4.56840956e-02, -1.02755181e+00,
       -1.22928930e+00, -8.83358472e-01, -7.08934637e-02,  3.74053351e-01,
       -2.45937384e-02,  7.72606583e-02, -6.83913218e-01, -7.20837668e-01,
        1.12062282e+00, -5.48141603e-02, -8.24137242e-02,  9.35986501e-01,
        1.23853712e+00,  1.27279553e+00,  4.05892218e-01, -5.03252214e-02,
        2.89317539e-01,  1.79305677e-01,  1.39748056e+00,  2.92046792e-01,
        6.38405674e-01, -2.78877131e-02,  1.37105185e+00, -2.05280763e+00,
        3.80509078e-01,  7.55390669e-01, -1.15912585e+00,  2.15031011e+00,
       -1.50270219e-01, -1.61164280e-01, -1.07944248e+00,  8.77966184e-01,
        2.24467414e-01, -5.91593454e-01,  2.26262802e-01,  6.86182507e-01,
        1.21500461e+00,  2.16059441e-01, -9.64823557e-01, -5.56607805e-01,
       -2.29838764e+00, -7.32082126e-01,  7.36469100e-01,  4.65716719e-01,
       -1.07876049e-01, -3.41436294e-01,  1.58453379e+00,  2.82241206e-01,
        9.09546391e-01,  3.95071566e-01, -6.69376519e-01,  1.55536898e+00,
       -1.23813903e+00, -1.19617346e+00, -4.29149506e-01, -7.29659893e-01,
       -5.57468899e-01, -5.99953064e-01,  9.86827204e-01,  5.41946751e-02,
        3.51907443e-01, -1.58796951e+00, -8.46951349e-01,  1.08457026e+00,
       -1.20382665e+00,  1.17853089e+00, -1.03066585e+00,  2.99218328e-01,
       -8.46239971e-01,  1.96620300e-01, -8.99637825e-01, -2.56605429e-01,
        1.67254777e+00, -3.75269646e-01,  2.03679478e+00, -4.58793398e-01,
       -1.17576966e+00,  7.50524988e-02, -4.08990215e-01,  1.75653198e+00,
        8.60923069e-01,  1.18127398e+00,  6.31670171e-01,  2.47099711e+00,
        7.94302517e-01,  5.31352878e-01, -8.29398597e-01, -9.09303834e-01,
        1.84235934e-01,  9.97738175e-01,  1.11695904e+00, -9.44000541e-01,
        5.31406704e-01,  1.93345997e-01, -1.11826358e+00,  5.11845582e-01,
       -2.27056629e+00,  2.63163546e-01,  2.47131349e+00, -1.01988520e+00,
        1.87526150e-02, -1.89426422e+00, -7.55001656e-01,  7.56197740e-01,
       -1.04246201e+00, -3.42581430e-02, -3.55168299e-01, -3.78428368e-01,
        1.90648688e-01,  4.84396294e-01,  1.23026775e+00,  8.32970623e-01,
       -5.64941752e-01,  1.41469601e+00,  1.24828122e+00, -1.55894810e+00,
        6.65232592e-01,  8.25595172e-01,  9.66318833e-01,  5.47175299e-01,
       -1.29718326e+00, -2.67634333e-01, -2.07020656e+00, -1.57892554e-01,
        2.02894262e+00,  6.81570885e-01,  8.36203582e-01, -5.13488047e-01,
       -1.01573661e+00, -1.07027090e+00,  1.23912658e-01, -8.03015882e-01,
       -6.37635747e-01,  1.14449564e+00, -1.64090191e+00, -1.31400358e+00,
       -5.10352510e-01, -9.98608839e-02, -1.29506764e-01, -1.39670506e+00,
        1.93809351e-01, -1.29292728e-01,  3.54479094e-01, -1.08287264e+00,
        2.44939235e-01,  2.20820791e-01, -6.60432484e-01, -2.18535151e-01,
       -5.55999012e-01,  1.35638101e+00, -3.11960863e+00, -1.44767170e+00,
       -1.70578539e+00, -3.78119923e-01, -6.78493916e-01, -4.11245934e-01,
        7.19012644e-01, -1.63251948e+00, -8.45693631e-01, -2.23100058e-01,
       -1.20221832e+00,  3.69987683e-01,  3.29997358e-01, -7.10446611e-01,
       -1.77110716e+00,  1.60083585e+00,  4.71098065e-01,  4.23750625e-01,
        7.22604814e-02, -7.34696662e-03,  8.31075673e-01, -1.56055249e-02,
       -6.30906338e-01,  7.09501385e-01,  5.96951708e-02, -7.72475747e-01,
       -9.06239094e-01,  1.16547928e+00,  6.31047402e-01,  1.97551858e+00,
       -5.26655196e-01, -7.43540587e-01,  4.03890571e-01,  1.37940685e+00,
        5.96752401e-01,  4.33153072e-01,  1.88698807e+00, -7.43390939e-01,
       -1.24794902e+00, -7.44618316e-01, -3.16856989e-01,  3.73351314e-01,
        1.02196035e+00,  4.05609723e-01,  1.52331375e+00, -8.27508128e-01,
        1.90549546e+00, -8.12021693e-01,  1.17073624e+00, -9.37842967e-01,
        3.43267007e-01,  5.08984102e-02,  5.17559645e-01,  7.51424764e-01,
       -2.13199171e-01, -6.68236776e-02,  2.39111718e-01, -1.30500814e+00,
       -7.31236440e-01, -1.62440684e+00,  5.25050962e-03,  2.22215696e+00,
        7.41309224e-01, -8.65429707e-01, -7.07684696e-01,  9.75898764e-01,
       -4.74409383e-01, -1.60848203e+00, -1.02291555e+00, -1.05425642e+00,
       -1.02139871e+00,  6.75950820e-01,  7.07028719e-02, -1.48863945e+00,
       -5.39796993e-01, -1.13832102e+00, -1.20842052e+00, -1.50667492e+00,
        1.74716204e+00, -3.07329521e-01,  5.76230584e-01,  8.68743678e-01,
       -3.84271666e-01,  5.34919539e-01,  5.40615879e-01,  2.22456521e-01,
        2.16953213e+00,  2.83928102e-01, -2.28490514e-01,  6.46164480e-01,
        1.77796354e+00,  9.94308000e-01, -4.78299892e-01, -8.58764574e-01,
       -9.30850286e-01, -6.61899356e-01,  3.86500903e-01,  8.45988292e-01,
       -2.26994787e+00, -1.86681654e-02, -1.10501888e+00,  6.82899732e-01,
        9.14518493e-01, -7.78352115e-01, -4.49423204e-01, -9.51618630e-01,
        3.91078535e-01, -1.60996181e+00, -1.12557525e+00, -6.84623837e-01,
        1.22651896e+00,  2.40247280e+00,  1.99584190e-02, -1.23157125e+00,
        7.41864685e-02, -8.69049593e-01,  4.59819568e-01, -1.11370451e+00,
       -3.69487350e-01, -1.41055279e-02,  5.19943798e-01, -7.68884933e-02,
        1.26588858e+00,  1.24232762e-01, -1.81381491e+00,  9.24059031e-01,
       -2.91113406e-01, -6.69762242e-01,  1.50768468e+00, -9.93606188e-01,
        7.26674371e-02, -7.12974484e-01,  1.35242893e+00, -3.64017286e-01,
        2.35699478e-01, -1.39228465e+00,  1.43473399e+00, -1.06952042e+00,
        9.10459323e-01,  1.11370559e+00,  1.23231538e+00,  1.81411281e+00,
       -1.17073802e+00,  4.01982178e-01,  1.37969649e-01,  4.19915493e-01,
        1.09831954e+00,  1.09361768e-01, -8.16919212e-01, -9.72529682e-02,
        1.53923643e+00, -1.17898747e+00,  7.96842462e-02, -9.81300666e-01,
        1.10877941e+00, -1.64844862e+00, -3.41086469e-01, -1.24194966e-01,
        1.16915739e-01,  2.36121870e+00,  1.55516878e+00, -1.02985940e+00,
        2.15940445e+00, -1.19253343e+00, -1.87089050e+00, -1.49848205e+00,
        2.03450471e-01,  5.34860586e-01, -2.21108587e+00,  4.35974191e-01,
       -2.67052169e-01,  7.06389532e-01, -3.84606815e-01,  9.00081711e-01,
        5.64345130e-01, -1.17264499e+00,  1.44559200e+00,  2.12427128e-01,
        7.30048821e-01,  1.26177194e+00, -9.74758332e-01, -8.47372106e-02,
       -8.21697969e-01, -9.42372732e-01,  2.65979546e-01,  3.39791108e-01,
        1.33140349e+00,  1.38554064e+00, -2.13583034e-02, -8.37064726e-01,
        3.20068942e+00,  2.14788244e+00, -1.06664772e-01, -9.30154944e-01,
       -4.23674369e-01,  2.80961046e-01,  1.13155122e+00,  9.69383232e-01,
        4.35415205e-01, -2.47125731e-01,  1.68185205e-01, -3.10624535e-01,
        7.09335975e-02, -1.03372303e-01,  5.25325277e-01, -1.88267705e+00,
       -3.45678008e-01, -2.91309198e-01, -1.13063834e+00, -1.72724675e-01,
       -1.05354233e+00, -6.64553142e-01, -2.89681998e-01, -2.53171766e-01,
       -5.73783158e-01,  1.10347462e+00,  2.01165087e-01,  3.22351424e-01,
        2.33092758e-01, -6.68065235e-01, -8.83219013e-01,  8.39639691e-01,
       -3.53077897e-01, -1.77113747e+00, -2.19878710e+00,  2.21760184e-01,
       -7.37077207e-01, -6.75838533e-02, -5.47254160e-01, -4.07414631e-01,
       -1.72737620e-01, -1.24740736e+00, -1.87624193e-02,  9.86123587e-01,
        6.95674273e-01, -1.73962463e+00, -1.34163608e+00, -1.33282638e+00,
       -2.48068818e-01,  8.54834793e-01,  3.22984340e-01, -1.75364283e+00,
        5.48855340e-02,  8.07411591e-01, -4.49013978e-01,  1.90417969e+00,
       -6.51468305e-01,  1.17248231e+00,  2.35122688e+00, -1.27642360e+00,
       -3.23686621e-01,  5.74696204e-01,  3.21141765e+00, -1.78846554e+00,
        5.66050226e-01,  2.84796348e-01, -4.22376126e-01, -8.34852439e-01,
       -5.25916185e-01, -3.03053674e-01, -1.26985950e+00,  1.57548510e+00,
       -1.10845010e+00, -4.27519357e-01, -6.61481082e-01, -4.13253934e-01,
        9.29779267e-02, -7.57597067e-01, -2.36129912e-01,  1.72446043e+00,
        1.05620035e+00, -2.88028999e-01,  9.07177602e-01, -7.68494068e-01,
        2.25931240e-01, -1.42854248e+00, -1.14411867e+00, -8.66556389e-01,
        1.23753573e+00,  2.30691366e-01,  5.47763034e-01,  1.51652927e-01,
        3.66900043e-01,  4.19478919e-01,  7.65321189e-01,  1.61256679e-01,
       -9.16034823e-01, -7.90918993e-01,  1.21417311e+00,  1.41180344e+00,
        5.59364429e-01, -1.64489871e+00,  1.57517058e+00,  3.22935600e-01,
       -7.45220037e-02,  1.96548842e-02, -3.72683645e-01,  1.75834442e+00,
        1.68263067e+00, -1.06481789e+00, -1.89796109e-01,  3.03403443e-01,
        1.27573152e+00, -2.42960165e+00,  9.30610015e-01,  1.66783860e+00,
       -3.34090032e-01, -5.15106149e-02,  1.24325830e+00,  3.67036430e-01,
       -1.34618662e+00, -1.18188225e+00, -1.04500481e+00, -1.43236727e+00,
       -2.00886227e-02, -5.34166690e-01,  2.68754533e-02,  6.92732323e-01,
        1.77458224e+00,  2.02141113e-01, -1.88084695e+00,  1.37878553e+00,
       -1.33647093e-01,  1.15171173e+00, -4.66425062e-01,  2.88564390e-01,
       -1.51156922e-01, -4.21025412e-02,  1.26211915e+00, -6.72702969e-01,
        1.47547470e-01,  2.03816429e-01, -4.06218846e-01, -2.22197231e+00,
        3.31811656e-01, -2.86054756e+00, -1.52344944e+00, -4.77970317e-01,
        4.12657231e-01,  8.46392900e-01,  8.12101895e-01,  5.80603328e-01,
       -3.81073120e-01,  1.20099431e+00, -2.83772779e-01,  1.10710475e+00,
       -2.25610096e+00, -9.71854993e-01, -5.92905332e-01, -1.80984888e-02,
       -2.41274891e+00,  7.99226280e-01,  9.76130692e-01,  7.73092119e-01,
       -5.33216690e-01,  1.44149015e+00, -5.63981533e-01,  8.93470827e-01,
       -7.42512680e-02, -3.46069864e-02, -1.70816032e-01, -3.65517036e-02,
        1.09806562e+00,  1.42629484e+00,  1.41467983e+00,  8.94438213e-01,
        6.53670700e-01,  4.37152200e-01,  1.74635813e+00, -4.57095959e-01,
       -6.49308823e-01,  3.29631178e-02, -1.68504146e+00, -2.52598256e-01,
       -7.40313034e-02, -1.04422943e+00, -5.92776806e-01,  6.80170674e-01,
       -2.45973193e-01,  6.05624791e-02,  1.01972358e+00, -6.30050546e-01,
       -1.16037758e+00, -5.68747898e-02,  4.09270722e-01, -1.82967470e+00,
        6.41954142e-01, -3.29663996e-01, -4.29324018e-01, -8.76878553e-01,
       -1.99605506e-01,  9.50270920e-01,  5.13872750e-01,  7.97806039e-01,
       -3.78129354e-01,  1.58223187e+00,  1.26565747e+00, -2.97258104e-02,
       -2.63975939e+00,  5.11408937e-02,  2.74776943e+00, -6.41340596e-02,
       -1.03022593e+00,  1.69910136e+00, -6.23692147e-01,  4.87480901e-01,
        7.59003689e-01, -1.47967223e+00,  1.21195076e-01,  1.18862963e+00,
       -3.33439437e-01,  6.49091238e-01, -2.68320151e-02,  1.02504738e+00,
        1.84822504e+00, -1.10302841e+00, -2.90388788e-01,  3.91568101e-01,
       -6.35179488e-01, -8.30046051e-01, -3.49766369e-01, -2.73043102e-01,
       -6.57943966e-01,  3.26871488e-01,  8.06477506e-01,  7.45273260e-01,
        6.79356544e-01,  1.19250597e+00, -1.36682791e+00, -1.16610196e-01,
        1.89020240e-01,  5.25771351e-01, -1.61611005e+00,  1.88072206e+00,
       -8.90609769e-01,  2.64065068e-01,  7.37306312e-01,  1.08683733e+00,
       -6.86425763e-01, -5.41809934e-01,  3.71199796e-01,  5.87459116e-01,
        9.12199847e-01, -5.58262834e-02, -6.93849578e-01, -1.33469428e+00,
        1.74643808e+00, -1.37337178e+00,  7.01209730e-01,  2.80065839e-01,
        7.64387370e-01,  9.56512535e-01,  1.35260228e+00, -5.57675673e-02,
        4.00128333e-01, -1.95141827e+00,  4.87654583e-02, -9.04456538e-01,
       -1.50266126e-01,  1.24142710e+00,  1.10711736e-01,  1.09518667e+00,
       -1.96699537e-01,  4.04457880e-01, -4.08996512e-01, -2.54134859e+00,
       -7.09034551e-01, -2.61584450e-01,  1.62631878e-01,  8.00948081e-03,
       -1.20706299e-01,  9.54237782e-01,  6.31583051e-01, -3.91507141e-01,
        8.78542722e-01, -1.97955644e+00, -2.75772309e-01, -1.40276139e-01,
        1.31070480e+00, -5.28500651e-01, -1.46383938e+00,  1.85654973e-01,
        1.70252885e+00, -1.99544374e-01, -8.88567225e-02, -1.94608586e-01,
        6.27299579e-02,  1.31431080e+00,  1.97533222e+00,  4.83255311e-01,
       -9.18163044e-02,  1.86629965e+00,  1.12426883e-01,  7.96155755e-02,
       -3.43781159e-01, -3.01186339e-01,  2.55405106e-01, -2.72675415e-01,
        4.33152856e-01,  1.07167979e-01,  5.71301488e-01, -3.65811143e-01,
       -1.84096983e-01,  2.59634677e-01,  8.44739669e-02,  1.16225041e-01,
        1.18618327e+00, -1.05588866e+00, -1.92531911e+00,  7.41063995e-01,
       -2.25619867e-01,  1.36557115e+00, -6.91680767e-02, -1.15299609e+00,
        2.20967326e+00,  4.16474443e-01, -4.36370065e-01, -7.36003886e-01,
        5.77436642e-01, -6.61492763e-01,  4.04745377e-01,  1.17892344e+00,
       -1.37460854e+00, -3.42269285e-01,  4.93190798e-01,  1.67419420e+00,
        9.43233691e-01, -4.41555599e-01,  1.47481586e+00, -3.45749659e-01,
       -1.50040126e-01,  3.89896938e-01, -1.08308193e+00,  3.08547984e+00,
        1.20884340e+00,  2.30186339e-01, -5.57802141e-01, -1.14851471e+00,
        3.81971017e-01,  7.04365602e-01, -3.88899963e-01, -1.85506898e-01,
        5.66330561e-01, -5.14316746e-02, -1.84623690e+00,  6.74638603e-01,
        2.52036725e-01,  7.38055640e-01, -7.47455035e-01, -2.11733639e+00,
       -1.24066567e+00,  3.05211001e-01,  2.08559027e+00,  2.35953985e+00,
        3.09501519e-01, -1.45127282e+00, -3.30059784e-01,  4.52826884e-01,
        4.42335688e-01,  1.00453644e-01,  1.34452292e+00, -8.93585852e-01,
       -2.16067912e+00, -8.72209569e-01, -1.15675951e+00,  2.23833940e+00,
       -1.81078344e-01, -1.42330841e+00,  6.21797411e-01,  1.01150219e+00,
        5.80898468e-02,  1.97413065e-01,  1.02838433e+00,  5.19340217e-01,
       -6.95040014e-01,  5.93706415e-01,  9.33222659e-01,  3.46441675e-01,
        8.77310301e-01,  5.88943854e-01, -2.32237743e-01, -1.42786369e-01,
        6.17561542e-01, -5.49857188e-01,  1.15527732e+00,  1.22211314e+00,
       -2.02892326e+00, -6.67985788e-02, -7.47957405e-01, -6.31399197e-01,
        1.47630647e-01, -1.66716028e-01,  5.67283300e-01,  3.23970679e-01,
        3.72784476e-01, -7.80923775e-01, -3.46318386e-01,  1.46062736e+00,
       -2.47755133e+00,  1.71945608e+00, -5.59273509e-01,  1.18097398e+00,
       -2.59346818e+00, -4.17242207e-01,  8.49845257e-01,  1.51235852e-01,
        1.01700015e+00, -8.73684243e-01, -5.58382387e-01, -6.52810234e-01,
        5.08683548e-01,  4.63572064e-01, -1.21482075e-01, -2.62915619e-01,
       -2.90783934e-01,  8.81631845e-02, -9.47190487e-01, -5.57949240e-02,
       -1.42628014e-01, -5.38803680e-01, -5.68810617e-01,  1.47837068e+00,
       -6.13257840e-01,  4.13189600e-01,  1.36901951e+00,  7.41449461e-01,
        2.12223314e-02,  1.01479931e+00, -1.42454369e+00, -1.22979084e+00,
       -3.95445015e-01, -2.19221836e-01, -9.46068703e-02,  1.88075025e+00,
        1.68899606e+00, -3.71186734e-02,  2.56070265e-01, -9.06325704e-01,
        3.19810330e-01, -1.34149193e+00,  1.40031595e+00, -5.18227724e-01,
        5.58352650e-01, -1.30547512e+00,  1.39204144e+00,  6.12108552e-01,
        1.96032218e+00,  6.88082154e-02, -1.61927444e+00, -7.83655538e-01,
       -1.25498393e+00,  1.57890107e+00, -6.24035140e-01, -7.52088547e-01,
        5.96104190e-01,  2.66923552e-01,  4.93312599e-01, -5.01478344e-01,
       -1.99770485e+00, -1.35874699e+00, -2.19554107e+00,  1.28115129e+00,
        9.10711662e-01, -3.73667225e-01,  6.24494021e-01,  6.74017103e-01,
        6.37016040e-01,  5.32955071e-01,  8.84989640e-01,  8.31998074e-02,
       -2.21975447e+00, -2.76714798e+00,  1.26613253e+00,  5.98509237e-01,
       -2.51309108e+00,  1.75597388e-01, -8.77888581e-01, -5.47070340e-01,
       -2.60357335e+00,  7.73042027e-01, -8.33765144e-02,  8.18447261e-01,
        1.09093020e+00,  1.29142947e+00,  1.65147111e+00,  2.93889928e-01,
        2.19100411e-01, -6.37850133e-01,  5.30894232e-01, -2.37211561e-01])

In [77]:
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [78]:
# computing a quartile binning of the data and axtracting statistics
bins = pd.qcut(draws,4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [81]:
# producing a useful quartile name, with labels argument to .qcut()
bins = pd.qcut(draws,4,labels=['Q1','Q2','Q3','Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [82]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [83]:
# labeled bin categorical does not contain information about bin edges in data
# so, use .groupby() to extract some summary statistics
bins = pd.Series(bins,name='quartile')
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [84]:
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count','min','max'])
           .reset_index())
results

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_21004\700132863.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [87]:
# 'quartile' column in the result retains the original categorical information, including ordering, from bins:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [89]:
# Better Performance with Categoricals
# consider a Series with 10 million elements and a small number of distinct categories
N = 10_000_000
labels = pd.Series(['foo','bar','baz','qux']*(N // 4))
labels

0          foo
1          bar
2          baz
3          qux
4          foo
          ...
9999995    qux
9999996    foo
9999997    bar
9999998    baz
9999999    qux
Length: 10000000, dtype: object

In [93]:
# convert labels to categorical:
categories = labels.astype('category')
categories

0          foo
1          bar
2          baz
3          qux
4          foo
          ...
9999995    qux
9999996    foo
9999997    bar
9999998    baz
9999999    qux
Length: 10000000, dtype: category
Categories (4, object): ['bar', 'baz', 'foo', 'qux']

In [94]:
# labels use significantly more memory than categories
labels.memory_usage(deep=True)

520000132

In [95]:
categories.memory_usage(deep=True)

10000512

In [98]:
%time_=labels.astype('category')

UsageError: Line magic function `%time_=labels.astype('category')` not found.

In [99]:
# Categorical Methods
# Series containing categorical data have several special methods similar to Series.str()
s = pd.Series(['a','b','c','d']*2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [100]:
# special accessor attribute '.cat' provides access to categorical methods
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [101]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [102]:
# suppose we know th eactual set of categories for this data extends beyond the four values observed in the data
# use .set_categories() to change categoricals
actual_categories = ['a','b','c','d','e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [103]:
# data is unchanged, but the new categories will be reflected in operations that use them
# .value_counts()
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [104]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [105]:
# in large datasets, categoricals are often used as a convenient tool for memory savings and better performance
# after filtering a large DataFrame or Series, many of the categories might not appear in data
# we can use .remove_unused_categories() to trim
cat_s3 = cat_s[cat_s.isin(['a','b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [106]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [107]:
# Categorical methods for Series in pandas
# .add_categoires() : Append new (unused) categories at end of existing categories
# .as_ordered() : Make categories ordered
# .as_unordered() : Make categories unordered
# .remove_categories() : Remove categories, setting any removed values to null
# .remove_unused_categories() : Remove any category values that do not appear in the data
# .rename_categories() : Replace categories with indicated set of new category names; cannot cahge the number of categories
# .reorder_categories() : Behaves like .rename_categories(), but can also change the result to have ordered categories
# .set_categories() : Replace the categories iwth the indicated set of new categories; can add or remove categories

In [109]:
# Creating dummy variables for modeling
# when using statistics or machine learning tools, it often requires categorical data into dummy variables, known as one-hot encoding
# this involves creating a DataFrame with a column for each distinct category; columns contain 1s for occurrences of a given category and 0 otherwise
cat_s = pd.Series(['a','b','c','d']*2,dtype='category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
alphabet = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
alphabet

In [ ]:
decode_this = alphabet[18] + alphabet[7] + alphabet[8] + alphabet[19]
decode_this